

from main import analyse, calculate

tests_1 = [[('принять', 1), ('принять', 4), ('принять', 2), ('принять', 3),
            ('выгрузить', 3), ('выгрузить', 4), ('выгрузить', 2), ('выгрузить', 1)],
           [('принять', 46), ('выгрузить', 46), ('принять', 21), ('выгрузить', 21)],
           [('принять', 1), ('принять', 2), ('выгрузить', 1), ('принять', 3), ('принять', 4), ('выгрузить', 3)],
           [('принять', 2), ('принять', 1), ('принять', 4), ('принять', 3), ('выгрузить', 1), ('выгрузить', 3),
            ('принять', 5), ('выгрузить', 2), ('принять', 6), ('выгрузить', 4)]
           ]
tests_2 = [[3, 3, [6, 2, 3]]

           ]
for test in tests_1:
    print(analyse(test))
for test in tests_2:
    m = test[0]
    n = test[1]
    p = test[2]
    print(calculate(m, n, p))